-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/data_preparation_nice.log
  log type:  text
 opened on:  28 Feb 2024, 14:05:50

. clear

. 
. * import dataset
. import delimited ./output/input_nice.csv, delimiter(comma) varnames(1) case(p
> reserve) 
(17 vars, 500,000 obs)

. describe

Contains data
  obs:       500,000                          
 vars:            17                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
patient_index~e str10   %10s                  
death_date      str10   %10s                  
dereg_date      str10   %10s                  
death_with_co~e str10   %10s                  
covid           byte    %8.0g                 
covid_primary   byte    %8.0g                 
critical_care   byte    %8.0g                 
critical_days   byte    %8.0g                 
has_follow_up   byte    %8.0g                 
deceased        byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
sotrovimab_co~s byte    %8.0g                 
molnupiravir_~s byte    %8.0g                 
has_died        byte    %8.0g                 
patient_id      long    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. *  Convert strings to dates  *
. foreach var of varlist patient_index_date death_date death_with_covid_date de
> reg_date {
  2.   capture confirm string variable `var'
  3.   if _rc==0 {
  4.   rename `var' a
  5.   gen `var' = date(a, "YMD")
  6.   drop a
  7.   format %td `var'
  8.   }
  9. }
(377,015 missing values generated)
(450,000 missing values generated)
(200,000 missing values generated)
(450,000 missing values generated)

. 
. * Check exclusions
. sum age 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    500,000    40.27092    23.72067          0        109

. tab sex, m 

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
          F |    255,803       51.16       51.16
          M |    244,197       48.84      100.00
------------+-----------------------------------
      Total |    500,000      100.00

. tab has_follow_up, m 

has_follow_ |
         up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,000        5.00        5.00
          1 |    475,000       95.00      100.00
------------+-----------------------------------
      Total |    500,000      100.00

. tab deceased, m 

   deceased |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    495,000       99.00       99.00
          1 |      5,000        1.00      100.00
------------+-----------------------------------
      Total |    500,000      100.00

. 
. * has_died variable defined incorrectly
. drop has_died

. 
. * death_date any time after date admitted
. sum death_date death_with_covid_date

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  death_date |     50,000    22823.19    108.5705      22635      23011
death_with~e |    300,000     22857.5    332.7807      22282      23433

. 
. * End of study period
. gen study_end = date("31Dec2023", "DMY") 

. * 28 days after persons hospitalisation 
. gen patient_28_days = patient_index_date + 28
(377,015 missing values generated)

. 
. gen has_died = death_date <=patient_28_days

. tab has_died

   has_died |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    110,684       22.14       22.14
          1 |    389,316       77.86      100.00
------------+-----------------------------------
      Total |    500,000      100.00

. 
. * Checks
. count if death_date<=patient_28_days
  389,316

. count if death_date<patient_28_days
  50,000

. 
. * Find first of death or 28 days 
. egen patient_end_date = rowmin(patient_28_days death_date)
(339316 missing values generated)

. 
. count if patient_end_date!=patient_28_days 
  50,000

. 
. * Flag if first 6 months of 2023
. gen early_2023 = patient_index_date <= date("30Jun2023", "DMY")

. 
. * Flag if COVID primary reason 
. gen primary = (covid_primary==1)

. 
. * Open file to write results to 
. file open tablecontent using ./output/nice/mortality_nice.txt, write text rep
> lace
(note: file ./output/nice/mortality_nice.txt not found)

. file write tablecontent ("Population") _tab ("events") _tab ("total_person_mt
> hs") _tab ("Rate") _n 

. 
. * stset data
. stset patient_end_date, fail(has_died) id(patient_id) enter(patient_index_dat
> e) origin(patient_index_date)

                id:  patient_id
     failure event:  has_died != 0 & has_died < .
obs. time interval:  (patient_end_date[_n-1], patient_end_date]
 enter on or after:  time patient_index_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time patient_index_date

------------------------------------------------------------------------------
    500,000  total observations
    339,316  event time missing (patient_end_date>=.)           PROBABLE ERROR
     37,699  ignored because never entered
     12,301  observations end on or before enter()
------------------------------------------------------------------------------
    110,684  observations remaining, representing
    110,684  subjects
          0  failures in single-failure-per-subject data
  3,099,152  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        28

. 
. * 28-day mortality rate 
. strate, per(100000) 

         failure _d:  has_died
   analysis time _t:  (patient_end_date-origin)
             origin:  time patient_index_date
  enter on or after:  time patient_index_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(110684 records included in the analysis)

  +------------------------------------+
  | D         Y   Rate   Lower   Upper |
  |------------------------------------|
  | 0   30.9915      0       .       . |
  +------------------------------------+


. 
. * Write to file 
. safecount if covid==1 
  500,000

. local denominator = r(N) 

. safecount if has_died==1 
  389,316

. local died = round(r(N), 5)

. di `died'
389315

. sum _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    110,684          28           0         28         28

. egen total_follow_up = total(_t)

. sum total_follow_up

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    500,000     3099152           0    3099152    3099152

. local person_mth = round(r(mean), 5)/30 

. di `person_mth'
103305

. local rate = 100000*(`died'/`person_mth')

. di `rate'
376859.78

. 
. if `died' > 10 & `died'!=. {
.   file write tablecontent ("All") _tab (`died') _tab (`person_mth') _tab (`ra
> te') _n 
. }

. else { 
.     file write tablecontent ("All") _tab ("redact") _n
.     continue
. }

. 
. * 28-day mortality for people treated with sotruvimab and molnupiravir 
. 
. tab sotrovimab_covid_therapeutics molnupiravir_covid_therapeutics

sotrovimab | molnupiravir_covid_th
_covid_the |      erapeutics
 rapeutics |         0          1 |     Total
-----------+----------------------+----------
         0 |   179,941    120,059 |   300,000 
         1 |   120,059     79,941 |   200,000 
-----------+----------------------+----------
     Total |   300,000    200,000 |   500,000 

. 
. gen covid_therapeutics = sotrovimab_covid_therapeutics 

. replace covid_therapeutics = 2 if molnupiravir_covid_therapeutics==1
(200,000 real changes made)

. 
. strate covid_therapeutics, per(100000) 

         failure _d:  has_died
   analysis time _t:  (patient_end_date-origin)
             origin:  time patient_index_date
  enter on or after:  time patient_index_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(110684 records included in the analysis)

  +-----------------------------------------------+
  | covid_~s   D         Y   Rate   Lower   Upper |
  |-----------------------------------------------|
  |        0   0   11.1516      0       .       . |
  |        1   0    7.4007      0       .       . |
  |        2   0   12.4393      0       .       . |
  +-----------------------------------------------+


. 
. * Write to file 
. safecount if covid_therapeutics==0 
  179,941

. local denominator = r(N) 

. safecount if has_died==1 & covid_therapeutics==0 
  140,114

. local died_none = round(r(N), 5)

. egen total_follow_up_none = total(_t) if covid_therapeutics==0
(320059 missing values generated)

. sum total_follow_up_none if covid_therapeutics==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~e |    179,941     1115156           0    1115156    1115156

. local person_mth_none = round(r(mean), 5)/30 

. di `person_mth_none'
37171.833

. local rate_none = 100000*(`died_none'/`person_mth_none')

. di `rate_none'
376938.63

. 
. safecount if covid_therapeutics==1 
  120,059

. local denominator = r(N) 

. safecount if has_died==1 & covid_therapeutics==1 
  93,628

. local died_sotrov = round(r(N), 5)

. egen total_follow_up_sotrov = total(_t) if covid_therapeutics==1
(379941 missing values generated)

. sum total_follow_up_sotrov if covid_therapeutics==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~v |    120,059      740068           0     740068     740068

. local person_mth_sotrov = round(r(mean), 5)/30 

. di `person_mth_sotrov'
24669

. local rate_sotrov = 100000*(`died_sotrov'/`person_mth_sotrov')

. di `rate_sotrov'
379545.18

. 
. safecount if covid_therapeutics==2 
  200,000

. local denominator = r(N) 

. safecount if has_died==1 & covid_therapeutics==2
  155,574

. local died_molnu = round(r(N), 5)

. egen total_follow_up_molnu = total(_t) if covid_therapeutics==2
(300000 missing values generated)

. sum total_follow_up_molnu if covid_therapeutics==2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~u |    200,000     1243928           0    1243928    1243928

. local person_mth_molnu = round(r(mean), 5)/30 

. di `person_mth_molnu'
41464.333

. local rate_molnu = 100000*(`died_molnu'/`person_mth_molnu')

. di `rate_molnu'
375201.98

. 
. if `died_none' > 10 & `died_none'!=. {
.   file write tablecontent ("No prior therapeutics") _tab (`died_none') _tab (
> `person_mth_none') _tab (`rate_none') _n 
. }

. else { 
.     file write tablecontent ("No prior therapeutics") _tab ("redact") _n
.     continue
. }

. 
. if `died_sotrov' > 10 & `died_sotrov'!=. {
.   file write tablecontent ("Sotruvimab") _tab (`died_sotrov') _tab (`person_m
> th_sotrov') _tab (`rate_sotrov') _n 
. }

. else { 
.     file write tablecontent ("Sotruvimab") _tab ("redact") _n
.     continue
. }

. 
. if `died_molnu' > 10 & `died_molnu'!=. {
.   file write tablecontent ("Molnupiravir") _tab (`died_molnu') _tab (`person_
> mth_molnu') _tab (`rate_molnu') _n 
. }

. else { 
.     file write tablecontent ("Molnupiravir") _tab ("redact") _n
.     continue
. }

. 
. * 28-day mortality for people in critical care vs not 
. strate critical_care, per(100000) 

         failure _d:  has_died
   analysis time _t:  (patient_end_date-origin)
             origin:  time patient_index_date
  enter on or after:  time patient_index_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(110684 records included in the analysis)

  +-----------------------------------------------+
  | critic~e   D         Y   Rate   Lower   Upper |
  |-----------------------------------------------|
  |        0   0   29.4462      0       .       . |
  |        1   0    1.5453      0       .       . |
  +-----------------------------------------------+


. 
. * Write to file 
. safecount if critical_care==0 
  475,000

. local denominator = r(N) 

. safecount if has_died==1 & critical_care==0 
  369,835

. local died_hosp = round(r(N), 5)

. egen total_follow_up_hosp = total(_t) if critical_care==0
(25000 missing values generated)

. sum total_follow_up_hosp if critical_care==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_fol~sp |    475,000     2944620           0    2944620    2944620

. local person_mth_hosp = round(r(mean), 5)/30 

. di `person_mth_hosp'
98154

. local rate_hosp = 100000*(`died_hosp'/`person_mth_hosp')

. di `rate_hosp'
376790.55

. 
. safecount if critical_care==1 
  25,000

. local denominator = r(N) 

. safecount if has_died==1 & critical_care==1 
  19,481

. local died_crit = round(r(N), 5)

. egen total_follow_up_crit = total(_t) if critical_care==1
(475000 missing values generated)

. sum total_follow_up_crit if critical_care==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~t |     25,000      154532           0     154532     154532

. local person_mth_crit = round(r(mean), 5)/30 

. di `person_mth_crit'
5151

. local rate_crit = 100000*(`died_crit'/`person_mth_crit')

. di `rate_crit'
378178.99

. 
. if `died_hosp' > 10 & `died_hosp'!=. {
.   file write tablecontent ("Hospitalised (not critical)") _tab (`died_hosp') 
> _tab (`person_mth_hosp') _tab (`rate_hosp') _n 
. }

. else { 
.     file write tablecontent ("Hospitalised (not critical)") _tab ("redact") _
> n
.     continue
. }

. 
. if `died_crit' > 10 & `died_crit'!=. {
.   file write tablecontent ("Hospitalised (critical)") _tab (`died_crit') _tab
>  (`person_mth_crit') _tab (`rate_crit') _n 
. }

. else { 
.     file write tablecontent ("Hospitalised (critical)") _tab ("redact") _n
.     continue
. }

. 
. * First 6 months 2023 vs last 6 months 2023
. 
. strate early_2023, per(100000)

         failure _d:  has_died
   analysis time _t:  (patient_end_date-origin)
             origin:  time patient_index_date
  enter on or after:  time patient_index_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(110684 records included in the analysis)

  +-----------------------------------------------+
  | ear~2023   D         Y   Rate   Lower   Upper |
  |-----------------------------------------------|
  |        0   0   15.5747      0       .       . |
  |        1   0   15.4168      0       .       . |
  +-----------------------------------------------+


. 
. safecount if early_2023==1 
  61,169

. local denominator = r(N) 

. safecount if has_died==1 & early_2023==1 
  6,109

. local died_early = round(r(N), 5)

. di `died_early'
6110

. egen total_follow_up_early = total(_t) if early_2023==1
(438831 missing values generated)

. sum total_follow_up_early if early_2023==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~y |     61,169     1541680           0    1541680    1541680

. local person_mth_early = round(r(mean), 5)/30 

. di `person_mth_early'
51389.333

. local rate_early = 100000*(`died_early'/`person_mth_early')

. di `rate_early'
11889.627

. 
. safecount if early_2023==0 
  438,831

. local denominator = r(N) 

. safecount if has_died==1 & early_2023==0 
  383,207

. local died_late = round(r(N), 5)

. egen total_follow_up_late = total(_t) if early_2023==0
(61169 missing values generated)

. sum total_follow_up_late if early_2023==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_fol~te |    438,831     1557472           0    1557472    1557472

. local person_mth_late = round(r(mean), 5)/30 

. di `person_mth_late'
51915.667

. local rate_late = 100000*(`died_late'/`person_mth_late')

. di `rate_late'
738129.79

. 
. if `died_early' > 10 & `died_early'!=. {
.   file write tablecontent ("Jan-June 2023") _tab (`died_early') _tab (`person
> _mth_early') _tab (`rate_early') _n 
. }

. else { 
.     file write tablecontent ("Jan-June 2023") _tab ("redact") _n
.     continue
. }

. 
. if `died_late' > 10 & `died_late'!=. {
.   file write tablecontent ("July-Dec 2023") _tab (`died_late') _tab (`person_
> mth_late') _tab (`rate_late') _n 
. }

. else { 
.     file write tablecontent ("July-Dec 2023") _tab ("redact") _n
.     continue
. }

. 
. * Primary reason COVID vs any position
. 
. strate primary, per(100000)

         failure _d:  has_died
   analysis time _t:  (patient_end_date-origin)
             origin:  time patient_index_date
  enter on or after:  time patient_index_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(110684 records included in the analysis)

  +----------------------------------------------+
  | primary   D         Y   Rate   Lower   Upper |
  |----------------------------------------------|
  |       1   0   30.9915      0       .       . |
  +----------------------------------------------+


. 
. safecount if primary==1 
  500,000

. local denominator = r(N) 

. safecount if has_died==1 & primary==1 
  389,316

. local died_primary = round(r(N), 5)

. di `died_primary'
389315

. egen total_follow_up_primary = total(_t) if primary==1

. sum total_follow_up_primary if primary==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_fol~ry |    500,000     3099152           0    3099152    3099152

. local person_mth_primary = round(r(mean), 5)/30 

. di `person_mth_primary'
103305

. local rate_primary = 100000*(`died_primary'/`person_mth_primary')

. di `rate_primary'
376859.78

. 
. safecount if primary==0 
  0

. local denominator = r(N) 

. safecount if has_died==1 & primary==0 
  0

. local died_any = round(r(N), 5)

. egen total_follow_up_any = total(_t) if primary==0
(500000 missing values generated)

. sum total_follow_up_any if primary==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_fol~ny |          0

. local person_mth_any = round(r(mean), 5)/30 

. di `person_mth_any'
.

. local rate_any = 100000*(`died_any'/`person_mth_any')

. di `rate_any'
.

. 
. if `died_primary' > 10 & `died_primary'!=. {
.   file write tablecontent ("Primary") _tab (`died_primary') _tab (`person_mth
> _primary') _tab (`rate_primary') _n 
. }

. else { 
.     file write tablecontent ("Primary") _tab ("redact") _n
.     continue
. }

. 
. if `died_any' > 10 & `died_any'!=. {
.   file write tablecontent ("Other position") _tab (`died_any') _tab (`person_
> mth_any') _tab (`rate_any') _n 
. }

. else { 
.     file write tablecontent ("Other position") _tab ("redact") _n
. }

. 
. file close tablecontent

. 
end of do-file

. . file open output using "/tmp/data_preparation_and_descriptives_nice.do.ZCyj
> .out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


